#Даны два списĸа, удалите все элементы первого списĸа из второго
list1 = [1, 2, 6, 7, 21, 46]
list2 = [1 , 46, 95, 65, 43, 78]
j = []
for i in list2:
    if i not in list1:
        j.append(i)
print(j)