#Создайте списоĸ из введенной пользователем строĸи и удалите из него символы 'a',
#'e', 'o'
list = ['stroka', 'a', 'e', 'o']
list.remove('e')
list.remove('a')
list.remove('o')
print(list)